notebook/bash.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-03-20 Wed 20:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Bash 笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Saul Lawliet" />
<link rel="stylesheet" type="text/css" href="/assets/css/org.css" />
<link rel="stylesheet" href="https://saullawliet.github.io/assets/css/org.css" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Bash 笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8a92ea1">基本</a></li>
<li><a href="#orgb0a2da5">小提示</a></li>
<li><a href="#org2262951">代码片段</a>
<ul>
<li><a href="#orgacf6a8d">最小代码模板</a></li>
<li><a href="#org3ddad16">获取脚本的目录信息</a></li>
<li><a href="#orga4daf43">从命令声明数组</a></li>
<li><a href="#orgec98e2b">遍历文件的行</a></li>
<li><a href="#org43ec3cd">遍历文件和目录</a></li>
<li><a href="#orgd2963de">切换用户执行</a></li>
</ul>
</li>
</ul>
</div>
</div>
<hr />

<div id="outline-container-org8a92ea1" class="outline-2">
<h2 id="org8a92ea1">基本</h2>
<div class="outline-text-2" id="text-org8a92ea1">
<ul class="org-ul">
<li>基本语法介绍: <a href="https://devhints.io/bash">Bash scripting cheatsheet</a>, 推荐 <b>熟读</b> 或 <b>随手查阅</b>.</li>
<li>脚本参数设计: <a href="http://docopt.org/">Command-line interface description language</a></li>
<li>进阶书籍: <a href="https://github.com/dylanaraps/pure-bash-bible">Pure Bash Bible</a>, 真·大佬出品.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb0a2da5" class="outline-2">
<h2 id="orgb0a2da5">小提示</h2>
<div class="outline-text-2" id="text-orgb0a2da5">
<ul class="org-ul">
<li>使用变量时, 一定要用引号. 如: <code>echo "$var"</code></li>
<li>声明函数时, 无需使用关键字 <code>function</code></li>
<li>执行命令时, 用 <code>$()</code> 代替 <code>` `</code>. 如: <code>var="$(command "$(command)")"</code></li>
</ul>
</div>
</div>

<div id="outline-container-org2262951" class="outline-2">
<h2 id="org2262951">代码片段</h2>
<div class="outline-text-2" id="text-org2262951">
<p>
下面保存一些常用的代码, 提高开发效率;)
</p>
</div>

<div id="outline-container-orgacf6a8d" class="outline-3">
<h3 id="orgacf6a8d">最小代码模板</h3>
<div class="outline-text-3" id="text-orgacf6a8d">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1;">#</span><span style="color: #93a1a1;">!/usr/bin/</span><span style="color: #859900; font-weight: bold;">env</span><span style="color: #93a1a1;"> bash</span>

<span style="color: #268bd2;">main</span>() {
  ...
}

main <span style="color: #2aa198;">"$@"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3ddad16" class="outline-3">
<h3 id="org3ddad16">获取脚本的目录信息</h3>
<div class="outline-text-3" id="text-org3ddad16">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">&#33050;&#26412;&#30495;&#23454;&#38142;&#25509;</span>
<span style="color: #268bd2;">script_link</span>=<span style="color: #2aa198;">"$(readlink -f "$0")"</span>
printf <span style="color: #2aa198;">'%s\n'</span> <span style="color: #2aa198;">"$script_link"</span>

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">&#33050;&#26412;&#25152;&#22312;&#30446;&#24405;</span>
<span style="color: #268bd2;">script_dir</span>=<span style="color: #2aa198;">"$(dirname "$(readlink -f "$0")")"</span>
printf <span style="color: #2aa198;">'%s\n'</span> <span style="color: #2aa198;">"$script_dir"</span>

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">&#33050;&#26412;&#25991;&#20214;&#21517;</span>
<span style="color: #268bd2;">script_file</span>=<span style="color: #2aa198;">"$(basename "$(readlink -f "$0")")"</span>
printf <span style="color: #2aa198;">'%s\n'</span> <span style="color: #2aa198;">"$script_file"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga4daf43" class="outline-3">
<h3 id="orga4daf43">从命令声明数组</h3>
<div class="outline-text-3" id="text-orga4daf43">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #657b83; font-weight: bold;">read</span> -d <span style="color: #2aa198;">""</span> -ra a1 &lt;&lt;&lt; <span style="color: #2aa198;">"$(seq 1 2)"</span>
<span style="color: #657b83; font-weight: bold;">echo</span> <span style="color: #2aa198;">"${a1[@]}"</span>
<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">output:</span>
<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">1 2</span>

<span style="color: #268bd2;">a2</span>=(<span style="color: #2aa198;">"$(seq 1 5)"</span>)
<span style="color: #657b83; font-weight: bold;">echo</span> <span style="color: #2aa198;">"${a2[@]}"</span>
<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">output:</span>
<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">1</span>
<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">2</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgec98e2b" class="outline-3">
<h3 id="orgec98e2b">遍历文件的行</h3>
<div class="outline-text-3" id="text-orgec98e2b">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #859900; font-weight: bold;">while </span><span style="color: #657b83; font-weight: bold;">read</span> -r line; <span style="color: #859900; font-weight: bold;">do</span>
    printf <span style="color: #2aa198;">'%s\n'</span> <span style="color: #2aa198;">"$line"</span>
<span style="color: #859900; font-weight: bold;">done</span> &lt; <span style="color: #2aa198;">"file"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org43ec3cd" class="outline-3">
<h3 id="org43ec3cd">遍历文件和目录</h3>
<div class="outline-text-3" id="text-org43ec3cd">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #859900; font-weight: bold;">for</span> file<span style="color: #859900; font-weight: bold;"> in</span> *; <span style="color: #859900; font-weight: bold;">do</span>
    printf <span style="color: #2aa198;">'%s\n'</span> <span style="color: #2aa198;">"$file"</span>
<span style="color: #859900; font-weight: bold;">done</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd2963de" class="outline-3">
<h3 id="orgd2963de">切换用户执行</h3>
<div class="outline-text-3" id="text-orgd2963de">
<div class="org-src-container">
<pre class="src src-sh">su &lt;other_user&gt; &lt;&lt; !
  ...
  <span style="color: #859900; font-weight: bold;">exit</span>
<span style="color: #b58900; font-weight: bold;">!</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Saul Lawliet</p>
<p class="date">Created: 2019-03-20 Wed 20:42</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
